app/Controllers/Product.php

    public function index(){
        $model = new ProductModel();
        $data['products'] = $model->orderBy('_id',"DESC")->findAll();
---
SELECT *
FROM `products`
ORDER BY `_id` DESC

    public function getProductById($id = null){
        $model = new ProductModel();
        $data = $model->where('_id',$id)->first();
---
SELECT *
FROM `products`
WHERE `_id` IS NULL
 LIMIT 1